app/Http/Controllers/LoanController.php

    public function list_loan()
    {
        $user_id = Auth::user()->id;
        $loans = Loan::with(['accepted_bank', 'accepted_bank.bank' => function ($query) {
            return $query->get('name');
        }])->where('user_id', $user_id)->get();
---
SELECT "banks"."name" FROM "banks" WHERE "banks"."id" in (2)
SELECT * FROM "accepted_banks" WHERE "accepted_banks"."loan_id" in (3)
SELECT * FROM "loans" WHERE "user_id" = '2'